#+TITLE: Generalized Fibonacci Memory Allocator

#+OPTIONS: toc:2
#+LaTeX_HEADER: \usepackage{tikz}
#+LaTeX_HEADER: \usepackage[final]{pdfpages}
#+Begin_Latex
\pagebreak
#+End_Latex

** Array Initialization
The array is a dynamic array: when it reaches its maximal capacity, it
is extended by allocating a bigger array and copying the old data into
the new array, after which the area occupied by the old array is
freed.

One of the important things about the array is that our allocator is
used to extend the array.  For this reason we have to be sure that the
array contains a free list which is able to "accept" our array when we
need to allocate a new one.  After extending the array, we also
initialize the cells for the new array in order to be able to insert
it into its free list, but it's not really a problem, since if the old
array could contain enough bytes for the old array, a twice bigger
array is more likely to have a cell with size big enough because the
size of the array grows linearly, whereas the sizes of free list have
a Fibonacci-like growth, which is exponential.

Now I will show how I calculated the /defines/ for the initialization
of the array.  It's the same for 64 bits, 32 bits and 16 bits, so I'll
only show the 64 bits.

| index | flsz | capacity | array-bytes | area-bytes | store-itself |
|-------+------+----------+-------------+------------+--------------|
|     0 |    3 |        1 |          16 |         16 | true         |
|     1 |    4 |        2 |          32 |         24 | false        |
|     2 |    5 |        4 |          64 |         32 | false        |
|     3 |    7 |        4 |          64 |         48 | false        |
|     4 |   10 |        8 |         128 |         72 | false        |
|     5 |   14 |        8 |         128 |        104 | false        |
|     6 |   19 |        8 |         128 |        144 | true         |
|     7 |   26 |        8 |         128 |        200 | true         |
|     8 |   36 |       16 |         256 |        280 | true         |
|     9 |   50 |       16 |         256 |        392 | true         |
|    10 |   69 |       16 |         256 |        544 | true         |
#+TBLFM: $4=$3*16::$5=($2-1)*8::$6=$5>=$4?true:false::@3$3..@12$3=2^(floor(log($1,2))+1)::@6$2..@12$2=@-4$2+@-1$2

As I have already described, the first size in the array will be 3.
The column name /flsz/ stands for /free list item size in blocks/.

The /capacity/ column says how many cells the array contains.  And the
/array-bytes/ column is the same thing in bytes.

The /area-bytes/ column is how many bytes a free list at the given
index can contain.  And when this value is greater or equal to the
/area-bytes/ value, the column /store-itself/ indicates /true/.
Otherwise it's /false/.

So, after the index 6, the array consistently can store itself.  And
we can be sure of that because the growth of the size of the free
lists is greater than the growth of the capacity.

But I have decided to avoid allocating small amounts of memory space.
For 64 bits it's 512, which corresponds to the row with /index/ 10.
As we see from this table, allocating 544 bytes for the initial array
is completely possible and that's what I do.  Here is the code form
the file ~mem.c~:

#+BEGIN_SRC c
/* 64-bit OS */
#if defined(__x86_64__)
#define MIN_SIZE 3
#define SIZE_1 4
#define SIZE_2 5
#define SIZE_3 7
#define DATA_INIT_BLOCKS 69
#define ARRAY_INIT_SIZE 11
#define ARRAY_INIT_CAPACITY 16
#+END_SRC

Just for info, this is what I do for 32-bit and 16-bit systems:

#+BEGIN_SRC c
/* 32-bit OS */
#elif defined(__386__) || defined(__i386__) || defined(__DJGPP__)
#define MIN_SIZE 2
#define SIZE_1 3
#define SIZE_2 4
#define SIZE_3 5
#define DATA_INIT_BLOCKS 36
#define ARRAY_INIT_SIZE 10
#define ARRAY_INIT_CAPACITY 16

/* 16-bit OS */
#elif defined(__I86__) || defined(__86__)
#define MIN_SIZE 1
#define SIZE_1 2
#define SIZE_2 3
#define SIZE_3 4
#define DATA_INIT_BLOCKS 19
#define ARRAY_INIT_SIZE 9
#define ARRAY_INIT_CAPACITY 16

#else
#error Unsupported Operating System, sorry.
#endif
#+END_SRC

